[{"id":1687824000,"title":"What is UI/UX?.","type":"Design","date":"June 27, 2023","content":"\n<h3 style=\"color:#e5e5e5;\">What is UI/UX?</h3>\n<p style=\"color:#a3a3a3;\">\nUI and UX are important concepts that aim to improve the interactions \nbetween users and digital products. <span style=\"font-weight: medium; color:#e4e4e7\">UI</span> stands for <span style=\"font-weight: medium; color:#e4e4e7\">\"User Interface\"</span>\nand refers to the visual design and user interaction of an application or website. On the other hand, <span style=\"font-weight: medium; color:#e4e4e7\">UX</span> stands for \n<span style=\"font-weight: medium; color:#e4e4e7\">\"User Experience\"</span> and encompasses how users experience and feel about a product.\n</p>\n\n<br>\n<img src=\"https://user.oc-static.com/upload/2018/04/24/15245807359037_OpenClassrooms-whatisUX-UI-2.jpg\" alt=\"uıux\" width=\"250px\"/>\n\n<hr>\n\n<h4 style=\"color:#e5e5e5;\">What is UI</h4>\n<p style=\"color:#a3a3a3;\">\nUI encompasses everything that users see when they interact with a digital product.\nThis includes buttons, menus, colors, fonts, and graphics. The purpose of UI is to \nhelp users understand how to use an application or website and navigate it effectively.\nA successful UI provides users with a well-designed interface that guides and comforts them,\noffering a visually pleasing experience.\n</p>\n\n<h4 style=\"color:#e5e5e5;\">What is UX</h4>\n<p style=\"color:#a3a3a3;\">\nUX, on the other hand, refers to the user's experience when interacting \nwith a digital product. It relates to how users find and use a product \nand how satisfied they are with it. UX involves processes such as user \nresearch, user journey mapping, prototyping, and user testing to facilitate \nusers in achieving their goals. A successful UX enables users to use a \nproduct effortlessly and satisfactorily.\n</p>\n\n<p style=\"color:#a3a3a3;\">\nUI and UX are closely connected and should be considered together. A good UI helps users effectively use a product, while a good UX ensures users have a pleasant experience when using the product. To design a user-friendly interface, it is important to understand user needs, conduct usability testing, and be open to feedback.\n\nIn conclusion, UI and UX are important concepts that aim to improve the interactions between users and digital products. A successful UI/UX design aims to provide users with a visually appealing, user-friendly, and satisfying experience.\n</p>\n\n\n"},{"id":1687046400,"title":"About Me.","type":"About","date":"June 18, 2023","content":"\n<p style=\"color:#a3a3a3; \">In this writing, I will talk about myself and my goals. I will try to explain everything from why I started coding to what I have learned so far. If you'd like, let's get started.</p>\n\n<h4 style=\"color:#e5e5e5;\">-My Software Process </h5>\n\n<p style=\"color:#a3a3a3; font-weight: medium; \">Hello, my name is <span style=\"font-weight: medium; color:#e4e4e7\">Poyraz</span>. I'm currently 17 years old and I have been interested in the world of software for about 2 years. However, I have actively started developing projects in this field for the past year. During this time, I have put a great deal of effort into self-improvement and I am currently focusing on<span style=\"font-weight: medium; color:#e4e4e7\"> frontend and UI/UX areas. </span> </p>\n\n<p style=\"color:#a3a3a3; \">Last year, I dedicated a lot of time and energy to improve my frontend skills. I became proficient in <span style=\"font-weight: medium; color:#e4e4e7\">HTML, CSS, and JavaScript </span>, gaining a solid foundation in web technologies. Then, I started learning popular technologies such as<span style=\"font-weight: medium; color:#e4e4e7\"> React, Tailwind, and Bootstrap.</span> I developed various projects using these technologies and faced different challenges to enhance my practical skills. </p>\n\n<p style=\"color:#a3a3a3; \">I also made an effort to develop my design skills. By using design tools like<span style=\"font-weight: medium; color:#e4e4e7\"> Figma and Photoshop </span>, I visualized my projects and learned design principles to create user-friendly interfaces. My interest in UI/UX design grew steadily, and I aimed to give my projects a professional appearance in this field. </p>\n\n<p style=\"color:#a3a3a3; \">Currently, I am focused on learning<span style=\"font-weight: medium; color:#e4e4e7\"> Next.js</span> and developing projects using this technology. I was impressed by Next.js' fast and scalable nature, and I want to expand my capabilities in building more complex web applications. I am researching various resources and taking courses to gain more experience and further develop myself in this area.</p>\n\n</br>\n\n<h4 style=\"color:#e5e5e5; font-weight: medium;\">-My primary aim </h5>\n\n<p style=\"color:#a3a3a3; \">My future goal is to study computer engineering at one of Turkey's leading universities. While education is certainly an important factor, I believe that university life is not solely about academic achievements. My aim in university is not only to acquire knowledge but also to develop myself by interacting with people from different disciplines and areas of interest.</p>\n\n<p style=\"color:#a3a3a3; \">My circle of friends at university will help me engage in higher-quality knowledge exchange and enable me to explore the world with different perspectives. Additionally, I want to take advantage of the opportunities offered by the university environment to promote my projects to a wider audience and access potential job opportunities.</p>\n\n<p style=\"color:#a3a3a3; \">During this process, I will make efforts to develop myself by focusing on both academic courses and exploring resources that support my self-learning journey. I aim to stay open to new technologies and trends while working on my own projects. Furthermore, I will read books on topics that interest me in order to gain a deeper knowledge in the field of software engineering and participate in various online courses.</p>\n\n</br>\n\n> <p style=\"color:#e5e5e5; \">Education is a progressive discovery of our own ignorance.</p>\n\n</br>\n\n<h4 style=\"color:#e5e5e5; font-weight: medium;\">-Consequently</h5>\n\n<p style=\"color:#a3a3a3; \">Of course, my life is not limited to just software and technology. I strive not to neglect my other interests. I enjoy reading books, engaging in sports, and watching documentaries and TV series. These activities are important sources for both relaxation and gaining inspiration from different perspectives.</p>\n\n<p style=\"color:#a3a3a3; \">In conclusion, I am dedicated to constantly improving myself in line with my passion for the world of software. I hope to further progress in my computer engineering education and projects in the future. I am determined to keep my motivation high and continue learning to fulfill my dreams.</p>\n\n\n\n\n\n\n"}]